[
{"title": "Creation", "text": [], "urls": []},
{"title": "Creation", "text": [], "urls": []},
{"title": "Creation of Music", "text": ["\"Composition\" is the act or practice of creating a song, aninstrumentalmusic piece, a work with both singing and instruments, or another type of music. In many cultures, including Western classical music, the act of composing also includes the creation ofmusic notation, such as asheet music\"score\", which is then performed by the composer or by other singers or musicians. In popular music and traditional music, the act of composing, which is typically called songwriting, may involve the creation of a basic outline of the song, called thelead sheet, which sets out themelody,lyricsandchord progression. In classical music, the composer typicallyorchestrateshis or her own compositions, but in musical theatre and in pop music, songwriters may hire an arranger to do the orchestration. In some cases, a songwriter may not use notation at all, and instead, compose the song in her mind and then play or record it from memory. In jazz and popular music, notable recordings by influential performers are given the weight that written scores play in classical music.", "Even when music is notated relatively precisely, as in classical music, there are many decisions that a performer has to make, because notation does not specify all of the elements of music precisely. The process of deciding how to perform music that has been previously composed and notated is termed \"interpretation\". Different performers' interpretations of the same work of music can vary widely, in terms of the tempos that are chosen and the playing or singing style orphrasingof the melodies. Composers and songwriters who present their own music are interpreting their songs, just as much as those who perform the music of others. The standard body of choices and techniques present at a given time and a given place is referred to asperformance practice, whereas interpretation is generally used to mean the individual choices of a performer.", "Although a musical composition often usesmusical notationand has a single author, this is not always the case. A work of music can have multiple composers, which often occurs inpopular musicwhen a band collaborates to write a song, or in musical theatre, when one person writes the melodies, a second person writes the lyrics, and a third person orchestrates the songs. In some styles of music, such as theblues, a composer/songwriter may create, perform and record new songs or pieces without ever writing them down in music notation. A piece of music can also be composed with words, images, or computer programs that explain or notate how the singer or musician should create musical sounds. Examples range from avant-garde music that usesgraphic notation, to text compositions such asAus den sieben Tagen, to computer programs that select sounds for musical pieces. Music that makes heavy use of randomness and chance is calledaleatoric music,and is associated with contemporary composers active in the 20th century, such asJohn Cage,Morton Feldman, andWitold Lutosławski. A commonly known example of chance-based music is the sound ofwind chimesjingling in a breeze.", "The study of composition has traditionally been dominated by examination of methods and practice of Western classical music, but the definition of composition is broad enough to include the creation ofpopular musicandtraditional musicsongs and instrumental pieces as well as spontaneouslyimprovisedworks like those offree jazzperformers and African percussionists such asEwe drummers.", "Performance is the physical expression of music, which occurs when a song is sung or piano piece, guitar melody, symphony, drum beat or othermusical partis played. In classical music, a work is written inmusic notationby a composer and then performed once the composer is satisfied with its structure and instrumentation. However, as it gets performed, the interpretation of a song or piece can evolve and change. In classical music, instrumental performers, singers or conductors may gradually make changes to the phrasing or tempo of a piece. In popular and traditional music, the performers have more freedom to make changes to the form of a song or piece. As such, in popular and traditional music styles, even when a band plays acover song, they can make changes such as adding aguitar soloor inserting an introduction.", "A performance can either be planned out and rehearsed (practiced)—which is the norm in classical music, jazzbig bands, and many popular music styles–orimprovisedover achord progression(a sequence of chords), which is the norm in smalljazzandbluesgroups. Rehearsals of orchestras,concert bandsandchoirsare led by a conductor. Rock, blues and jazz bands are usually led by the bandleader. A rehearsal is a structured repetition of a song or piece by the performers until it can be sung or played correctly and, if it is a song or piece for more than one musician, until the parts are together from a rhythmic and tuning perspective.", "Many cultures have strong traditions of solo performance (in which one singer or instrumentalist performs), such as in Indian classical music, and in the Western art-music tradition. Other cultures, such as inBali, include strong traditions of group performance. All cultures include a mixture of both, and performance may range from improvised solo playing to highly planned and organized performances such as the modern classical concert, religious processions, classical music festivals ormusic competitions.Chamber music, which is music for a small ensemble with only one or a few of each type of instrument, is often seen as more intimate than large symphonic works.", "Musical improvisation is the creation of spontaneous music, often within (or based on) a pre-existing harmonic framework,chord progression, orriffs. Improvisers use the notes of the chord, various scales that are associated with each chord, and chromatic ornaments and passing tones which may be neither chord tones nor from the typical scales associated with a chord. Musical improvisation can be done with or without preparation. Improvisation is a major part of some types of music, such asblues,jazz, andjazz fusion, in which instrumental performers improvise solos, melody lines, and accompaniment parts.", "In the Western art music tradition, improvisation was an important skill during the Baroque era and during the Classical era. In the Baroque era, performers improvised ornaments, andbasso continuokeyboard players improvisedchord voicingsbased onfigured bassnotation. As well, the top soloists were expected to be able to improvise pieces such aspreludes. In the Classical era, solo performers and singers improvised virtuosocadenzasduring concerts.", "However, in the 20th and early 21st century, as \"common practice\" Westernart musicperformance became institutionalized in symphony orchestras, opera houses, and ballets, improvisation has played a smaller role, as more and more music was notated in scores and parts for musicians to play. At the same time, some 20th and 21st centuryart musiccomposers have increasingly included improvisation in their creative work. InIndian classical music, improvisation is a core component and an essential criterion of performances."], "urls": ["/wiki/Instrumental", "/wiki/Music_notation", "/wiki/Sheet_music", "/wiki/Lead_sheet", "/wiki/Melody", "/wiki/Lyrics", "/wiki/Chord_progression", "/wiki/Orchestration", "#cite_note-75", "#cite_note-76", "/wiki/Musical_phrasing", "/wiki/Historically_informed_performance", "#cite_note-77", "/wiki/Musical_notation", "/wiki/Popular_music", "/wiki/Blues", "/wiki/Graphic_notation_(music)", "/wiki/Aus_den_sieben_Tagen", "/wiki/Aleatoric_music", "#cite_note-78", "/wiki/John_Cage", "/wiki/Morton_Feldman", "/wiki/Witold_Lutos%C5%82awski", "/wiki/Wind_chimes", "/wiki/Popular_music", "/wiki/Traditional_music", "/wiki/Music_improvisation", "/wiki/Free_jazz", "/wiki/Ewe_drumming", "/wiki/Part_(music)", "/wiki/Music_notation", "/wiki/Cover_song", "/wiki/Guitar_solo", "#cite_note-79", "/wiki/Big_band", "/wiki/Musical_improvisation", "/wiki/Chord_progression", "/wiki/Jazz", "/wiki/Blues", "/wiki/Concert_band", "/wiki/Choir", "/wiki/Bali", "/wiki/Music_competition", "/wiki/Chamber_music", "#cite_note-80", "/wiki/Chord_progression", "/wiki/Riffs", "/wiki/Blues", "/wiki/Jazz", "/wiki/Jazz_fusion", "#cite_note-auto1-81", "/wiki/Basso_continuo", "/wiki/Chord_voicing", "/wiki/Figured_bass", "/wiki/Prelude_(music)", "/wiki/Cadenza", "/wiki/Art_music", "/wiki/Art_music", "/wiki/Indian_classical_music"]}
]