[
{"title": "Creation", "text": ["\"Composition\" is the act or practice of creating a song, an ", " music piece, a work with both singing and instruments, or another type of music. In many cultures, including Western classical music, the act of composing also includes the creation of ", ", such as a ", " \"score\", which is then performed by the composer or by other singers or musicians. In popular music and traditional music, the act of composing, which is typically called songwriting, may involve the creation of a basic outline of the song, called the ", ", which sets out the ", ", ", " and ", ". In classical music, the composer typically ", " his or her own compositions, but in musical theatre and in pop music, songwriters may hire an arranger to do the orchestration. In some cases, a songwriter may not use notation at all, and instead, compose the song in her mind and then play or record it from memory. In jazz and popular music, notable recordings by influential performers are given the weight that written scores play in classical music.", "\n", "Even when music is notated relatively precisely, as in classical music, there are many decisions that a performer has to make, because notation does not specify all of the elements of music precisely. The process of deciding how to perform music that has been previously composed and notated is termed \"interpretation\". Different performers' interpretations of the same work of music can vary widely, in terms of the tempos that are chosen and the playing or singing style or ", " of the melodies. Composers and songwriters who present their own music are interpreting their songs, just as much as those who perform the music of others. The standard body of choices and techniques present at a given time and a given place is referred to as ", ", whereas interpretation is generally used to mean the individual choices of a performer.", "\n"], "urls": ["/wiki/Instrumental", "/wiki/Music_notation", "/wiki/Sheet_music", "/wiki/Lead_sheet", "/wiki/Melody", "/wiki/Lyrics", "/wiki/Chord_progression", "/wiki/Orchestration", "#cite_note-75", "#cite_note-76", "/wiki/Musical_phrasing", "/wiki/Historically_informed_performance", "#cite_note-77"]}
]